//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьВозрастРавное(Парам01)","УМеняЕстьВозрастРавное","Допустим у меня есть возраст равное 24");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьКоличествоМесяцевРавное(Парам01)","УМеняЕстьКоличествоМесяцевРавное","И у меня есть количество месяцев равное 12");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатУмноженияВозрастаИКоличествоМесяцевРавен(Парам01)","РезультатУмноженияВозрастаИКоличествоМесяцевРавен","Тогда результат умножения возраста и количество месяцев равен 288");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть возраст равное 24
//@УМеняЕстьВозрастРавное(Парам01)
Процедура УМеняЕстьВозрастРавное(Возраст) Экспорт
	Контекст.Вставить("Возраст", Возраст);
КонецПроцедуры

&НаКлиенте
//И у меня есть количество месяцев равное 12
//@УМеняЕстьКоличествоМесяцевРавное(Парам01)
Процедура УМеняЕстьКоличествоМесяцевРавное(КоличествоМесяцев) Экспорт
Контекст.Вставить("КоличествоМесяцев", КоличествоМесяцев);
	
КонецПроцедуры

&НаКлиенте
//Тогда результат умножения возраста и количество месяцев равен 288
//@РезультатУмноженияВозрастаИКоличествоМесяцевРавен(Парам01)
Процедура РезультатУмноженияВозрастаИКоличествоМесяцевРавен(ОжидаемыйРезультат) Экспорт
	Возраст = Контекст.Возраст;
	КоличествоМесяцев = Контекст.КоличествоМесяцев;
	Результат = ОбщийМодуль1.ПолучитьРезультатВозрастаВМесяцах(Возраст,КоличествоМесяцев);
	Если Не Результат = ОжидаемыйРезультат Тогда
		ВызватьИсключение "Расчитан неверно";
	КонецЕсли;	
	
КонецПроцедуры

//окончание текста модуля